# Pandas
Pandas是基于Numpy构建的，让Numpy为中心的应用变得更加简单。

Pandas有两个主要的数据结构：Series和DataFrame。

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Series
使用pd.Serises(arr, index)创建一个新的serise

Series的字表现形式为：索引在左边，值在右边。由于我们没有为数据指定索引。于是会自动创建一个0到N-1（N为长度）的整数型索引。

In [3]:
s = pd.Series([1,3,np.nan,1], index=['a', 'b', 'c', 'd'])
print(s)

a    1.0
b    3.0
c    NaN
d    1.0
dtype: float64

###### Series 的特性很像numpy中的array，可以理解为带索引的array，同时，通过s.values 和s.index可以对Series的元素进行查询

In [11]:
s[s.index == 'a']
s[s.values == 1.0]

a    1.0
d    1.0
dtype: float64

## DataFrame

DataFrame是一种类似表格的数据结构，包括了index和column作为列索引和行索引。可以认为DataFrame的每一列都是一个Series，每列可以是不同的值类型（数值，字符串，布尔值等）。   
### 创建DataFrame
#### 使用二维numpy array创建

In [26]:
df = pd.DataFrame(np.random.randn(3,4), index = [1,2,3], columns=list('abcd'))
df

          a         b         c         d
1  1.473762 -1.177336 -0.015982 -0.602205
2  0.408274  0.566030  0.702954  0.494189
3  0.408125  2.087367 -0.042257  0.219060

#### 使用嵌套字典创建
可以使用字典，循环嵌套字典来创建DataFrame

In [20]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

## 常用内置变量
1. df.dtypes
2. df.index
3. df.columns
4. df.values 返回一个list，list中的元素是每一行
5. df.describe()
6. df.T

In [5]:
print(df2.dtypes) # 返回一列的数据类型
print(df2.index)  # 返回索引
print(df2.columns) # 返回所有的colums
print(df2.values)  # 以list形式返回所有值，list中每个元素对应着每一行

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object
Int64Index([0, 1, 2, 3], dtype='int64')
Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')
[[1.0 Timestamp('2013-01-02 00:00:00') 1.0 3 'test' 'foo']
 [1.0 Timestamp('2013-01-02 00:00:00') 1.0 3 'train' 'foo']
 [1.0 Timestamp('2013-01-02 00:00:00') 1.0 3 'test' 'foo']
 [1.0 Timestamp('2013-01-02 00:00:00') 1.0 3 'train' 'foo']]

## 常用内置函数
#### describe 所有数值列的统计信息
#### head 显示文件的前5行
#### tail 显示文件的后5行
#### df.a.value_counts() # 统计该列每个值出现的个数

In [6]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [11]:
df.head()

                   a         b         c         d
2016-01-01  0.134930 -0.084706  1.898914 -1.255755
2016-01-02 -0.157281  0.542143 -1.198274 -1.320389
2016-01-03 -0.096835  1.007684 -0.504232 -1.870269
2016-01-04 -0.126735 -0.880361 -1.904125  0.607847
2016-01-05  1.769314 -0.380850 -0.033997 -1.348231

In [12]:
df.tail()

                   a         b         c         d
2016-01-02 -0.157281  0.542143 -1.198274 -1.320389
2016-01-03 -0.096835  1.007684 -0.504232 -1.870269
2016-01-04 -0.126735 -0.880361 -1.904125  0.607847
2016-01-05  1.769314 -0.380850 -0.033997 -1.348231
2016-01-06  0.389878 -2.083621 -0.927838  0.175310

In [48]:
df.a.value_counts() # 统计该列每个值出现的个数

0.408125    1
1.473762    1
0.408274    1
Name: a, dtype: int64

## 排序
1. df.sort_index(axis=, ascending=) 按照index或者columns进行排序，axis=0表示按照index
2. df.sort_values(by='column_name') 按照by指定的column进行排序

In [16]:
print(df.sort_index(axis=1, ascending=False))

                   d         c         b         a
2016-01-01 -1.255755  1.898914 -0.084706  0.134930
2016-01-02 -1.320389 -1.198274  0.542143 -0.157281
2016-01-03 -1.870269 -0.504232  1.007684 -0.096835
2016-01-04  0.607847 -1.904125 -0.880361 -0.126735
2016-01-05 -1.348231 -0.033997 -0.380850  1.769314
2016-01-06  0.175310 -0.927838 -2.083621  0.389878

In [19]:
print(df.sort_values(by='a'))

                   a         b         c         d
2016-01-02 -0.157281  0.542143 -1.198274 -1.320389
2016-01-04 -0.126735 -0.880361 -1.904125  0.607847
2016-01-03 -0.096835  1.007684 -0.504232 -1.870269
2016-01-01  0.134930 -0.084706  1.898914 -1.255755
2016-01-06  0.389878 -2.083621 -0.927838  0.175310
2016-01-05  1.769314 -0.380850 -0.033997 -1.348231

## 选择数据
虽然 DataFrame 支持 Python/Numpy 的索引语法，如果直接使用df[]，参数可以为index或column名称，表示选中行或列   
**[]中单个元素则会被认为选择列，如果是[:]切片则会被人为选择行**    
但是推荐使用 .at, .iat, .loc, .iloc 和 .ix 方法进行索引。

In [38]:
print(df['a'])# == print(df.a)

1    1.473762
2    0.408274
3    0.408125
Name: a, dtype: float64

In [39]:
print(df[0:2])  # 选择多行数据

          a         b         c         d
1  1.473762 -1.177336 -0.015982 -0.602205
2  0.408274  0.566030  0.702954  0.494189

### 使用loc选择行数据
1. pd.loc['index_name'] 
    1. 根据index和column的名称选择对应的元素
    2. 通过指定column名称可以选择index_name的部分列
2. pd.iloc['index_num']
    1. 根据位置选择，也就是说参数是第几行，第几列
3. pd.ix[]
    1. 混合选择，既可以是位置，也可以是名称

In [32]:
print(df.loc[1])
print(df.loc[1, ['a', 'b']])

a    1.473762
b   -1.177336
c   -0.015982
d   -0.602205
Name: 1, dtype: float64
a    1.473762
b   -1.177336
Name: 1, dtype: float64

In [33]:
print(df.iloc[1]) # 选择第二行
print(df.iloc[2,1]) #选择第四行第二列
print(df.iloc[[1,2], 1:3]) # 选择第2，3行对应的第2到4列

a    0.408274
b    0.566030
c    0.702954
d    0.494189
Name: 2, dtype: float64
2.0873665241265997
          b         c
2  0.566030  0.702954
3  2.087367 -0.042257

### 布尔索引
可以采用判断指令 (Boolean indexing) 进行选择. 我们可以约束某项条件然后选择出当前所有数据.

In [40]:
print(df[df['b'] > 0])

          a         b         c         d
2  0.408274  0.566030  0.702954  0.494189
3  0.408125  2.087367 -0.042257  0.219060

In [41]:
print(df.a > 0)

1    True
2    True
3    True
Name: a, dtype: bool

## 设置值
1. 使用loc或iloc选中对应的行或者区域并修改
2. 使用布尔判断，然后修改值

In [47]:
df.iloc[2,2] = 1111
df.loc[1, 'B'] = 2222
df.B[df.a>0] = 1 # 对于a大于0的位置. 更改B在相应位置上的数为1
df['e'] = np.nan # 添加一列，并且列的值为np.nan
df.loc[4] = np.nan
df

          a         b            c         d    B   F   e   4
1  1.473762 -1.177336    -0.015982 -0.602205  1.0 NaN NaN NaN
2  0.408274  0.566030     0.702954  0.494189  1.0 NaN NaN NaN
3  0.408125  2.087367  1111.000000  0.219060  1.0 NaN NaN NaN
4       NaN       NaN          NaN       NaN  NaN NaN NaN NaN

## 处理丢失数据
1. NaN数据，表示该处数据不存在
2. pd.dropna() 直接去掉包含NaN的行或列
3. pd.fillna(value=) 用指定值替代NaN
4. pd.isnull() 返回一个布尔DataFrame 判断对应位置是否为NaN

In [31]:
df.dropna(axis=0, # 0: 对行进行操作; 1: 对列进行操作
         how='any')# # 'any': 只要存在 NaN 就 drop 掉; 'all': 必须全部是 NaN 才 drop 
df.fillna(value=0.0)
df.isnull()

                         a      b      c      d      B     F     E
2016-01-01 00:00:00  False  False  False  False  False  True  True
2016-01-02 00:00:00  False  False  False  False   True  True  True
2016-01-03 00:00:00  False  False  False  False   True  True  True
2016-01-04 00:00:00  False  False  False  False   True  True  True
2016-01-05 00:00:00  False  False  False  False  False  True  True
2016-01-06 00:00:00  False  False  False  False  False  True  True
20130101              True   True   True   True  False  True  True

In [37]:
df.a.value_counts() # 统计该列每个值出现的个数

-0.157281    1
-0.096835    1
-0.126735    1
 1.769314    1
 0.134930    1
 0.389878    1
Name: a, dtype: int64

## 函数操作
使用apply()，接收一个函数，默认将函数作用在每个列上

In [33]:
df.apply(np.cumsum)

                            a         b            c         d       B   F   E
2016-01-01 00:00:00  0.134930 -0.084706     1.898914 -1.255755     1.0 NaN NaN
2016-01-02 00:00:00 -0.022351  0.457438     0.700640 -2.576144     NaN NaN NaN
2016-01-03 00:00:00 -0.119185  1.465122  1111.700640 -4.446414     NaN NaN NaN
2016-01-04 00:00:00 -0.245921  0.584761  1109.796515 -3.838567     NaN NaN NaN
2016-01-05 00:00:00  1.523393  0.203911  1109.762517 -5.186798     2.0 NaN NaN
2016-01-06 00:00:00  1.913271 -1.879710  1108.834679 -5.011488     3.0 NaN NaN
20130101                  NaN       NaN          NaN       NaN  2225.0 NaN NaN

In [38]:
df.apply(lambda x: x.max()-x.min()) # 求每一列的最大值和最小值的差

a       1.926595
b       3.091306
c    1112.904125
d       2.478117
B    2221.000000
F            NaN
E            NaN
dtype: float64

## 合并
可以使用 pd.concat 函数将多个 pandas 对象进行连接：

In [50]:
df = pd.DataFrame(np.random.randn(10, 4))
pieces = [df[:2], df[4:5]]
pd.concat(pieces)

          0         1         2         3
0 -0.711363 -0.879976 -1.217544 -1.633048
1  0.163960 -3.069807  0.082763 -0.074493
4 -1.709302 -0.554586 -1.301875 -0.121720

### 使用数据库中的join
merge 可以实现数据库中的 join 操作：

In [54]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
print(left)
print(right)

   key  lval
0  foo     1
1  foo     2
   key  rval
0  foo     4
1  foo     5

In [45]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### append添加行

In [49]:
df = pd.DataFrame(np.random.randn(5,4), columns=list('abcd'))
s = df.iloc[0]
df.append(s, ignore_index=True)

          a         b         c         d
0 -0.111235  0.656823 -0.297627  0.741059
1  1.183571 -0.378082  0.970377  0.502695
2  1.272084  0.125308  0.475627 -0.693742
3 -0.178238 -1.018988  0.836595 -0.814344
4  1.691081  1.122372 -0.563292  1.541796
5 -0.111235  0.656823 -0.297627  0.741059

### Grouping

In [51]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.168803 -1.197080
1  bar    one -1.101913  0.827056
2  foo    two -0.450693  0.212417
3  bar  three  0.653436  1.224843
4  foo    two -0.413082  1.795669
5  bar    two -0.105148  1.022904
6  foo    one  0.444775  0.077985
7  foo  three -0.737136 -0.610856

In [52]:
df.groupby('A').sum() # 所有A列值相同的行组成一组，并求每个组每个列元素的sum值

            C         D
A
bar -0.553625  3.074804
foo -0.987333  0.278135

In [53]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -1.101913  0.827056
    three  0.653436  1.224843
    two   -0.105148  1.022904
foo one    0.613578 -1.119095
    three -0.737136 -0.610856
    two   -0.863775  2.008086

## 数据导入导出
pandas可以读取多种格式的文件，json， csv，excel， html， pickle等

In [55]:
data = pd.read_csv()
data = pd.to_json()

TypeError: parser_f() missing 1 required positional argument: 'filepath_or_buffer'